// **********************************************
// 제 목 : 포인터 증감연산자를 이용한 배열 접근
// 날 짜 : 2026년 9월 10일
// 작성자 : 2600099 손재건
// **********************************************

#include <stdio.h>

int main(void)
{
    double arr[5];
    double *ptr = arr;
    int i;

    // 포인터 증감연산자를 이용하여 5개의 실수 입력
    printf("5개의 실수를 입력하시오.\n");

    for (i = 0; i < 5; i++)
        scanf("%lf", ptr++);

    // ptr을 다시 배열의 첫 번째 요소로 이동
    ptr = arr;

    // 모든 배열요소의 값을 2씩 증가
    for (i = 0; i < 5; i++)
        *(ptr++) += 2.0;

    // 결과 확인
    ptr = arr;

    printf("2씩 증가시킨 결과: ");

    for (i = 0; i < 5; i++)
        printf("%.2f ", *(ptr++));

    printf("\n");

    return 0;
}
